Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.1.1");
    
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
    ПараметрыРегистрации.Версия = ЭтотОбъект.Метаданные().Комментарий;
	ПараметрыРегистрации.БезопасныйРежим = Истина;
	
    ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказНаВнутреннееПотребление");
	
    КомандаПечати = ПараметрыРегистрации.Команды.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_РасходнаяНакладная";
	КомандаПечати.Представление = НСтр("ru = '* Расходная накладная'");
    КомандаПечати.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    КомандаПечати.ПоказыватьОповещение = Ложь;
    КомандаПечати.Модификатор = "ПечатьMXL";

    Возврат ПараметрыРегистрации;
    
КонецФункции

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ЗаданиеНаПеревозку = "";

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_РасходнаяНакладная") Тогда
	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПФ_MXL_РасходнаяНакладная",
			НСтр("ru = 'Расходная накладная'"),
			Сформировать_ТабДок(МассивОбъектов, ОбъектыПечати));

	КонецЕсли;
	
КонецПроцедуры

Функция Сформировать_ТабДок(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ИмяФормы", "ВПФ_ЗаказНаВнутреннееПотребление_РасходнаяНакладная");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Ремонт";
	НомерТипаДокумента = 0;
	
	Если ТипЗнч(МассивОбъектов) = Тип("Соответствие") Тогда 
		СтруктураТипов = МассивОбъектов;
	Иначе
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	КонецЕсли;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Макет = ПолучитьМакет("ПФ_MXL_РасходнаяНакладная");
		
		ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
		ОбластьШапкаТаблицы	  	= Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтрока			= Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьПодвалТаблицы	= Макет.ПолучитьОбласть("ПодвалТаблицы");
		ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
		
		ПервыйДокумент 	 		= Истина;
		
		Для каждого Док Из СтруктураОбъектов.Значение Цикл
		
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент 		= Ложь;
			НомерСтрокиНачало 	= ТабличныйДокумент.ВысотаТаблицы + 1;

			НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Док.Номер, Истина, Истина);
			ДатаДок = Формат(Док.Дата,"ДФ=dd.MM.yyyy" );
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Расходная накладная № " + НомерДок + " от " + ДатаДок;
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, Док);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);

			ДокПредставление = ОбщегоНазначенияУТ.ПолучитьПредставлениеДокумента(Док, Док.Номер, Док.Дата);
			ОбластьШапка.Параметры.Распоряжение = ДокПредставление;
			ОбластьШапка.Параметры.Склад		= Док.Склад;
			ОбластьШапка.Параметры.Поставщик	= Док.Организация;
			ОбластьШапка.Параметры.Покупатель	= Покупатели(Док);
			ДанныеПеревозки = РеквизитыПеревозки(Док);
			ОбластьШапка.Параметры.Водитель	= ДанныеПеревозки.Водитель;
			ОбластьШапка.Параметры.Транспорт	= ДанныеПеревозки.Транспорт;
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

			НомерСтроки = 1;
			Для каждого Т Из Док.Товары Цикл
			
				ОбластьСтрока.Параметры.НомерСтроки			= НомерСтроки;
				ОбластьСтрока.Параметры.Артикул				= Т.Номенклатура.Артикул;
				ОбластьСтрока.Параметры.Товар				= Т.Номенклатура;
				ОбластьСтрока.Параметры.Количество			= Т.Количество;
				ОбластьСтрока.Параметры.ЕдиницаИзмерения	= Т.Номенклатура.ЕдиницаИзмерения;
				
				НомерСтроки = НомерСтроки + 1;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
			
			ОбластьПодвал.Параметры.ВсегоНаименований = НомерСтроки-1;
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Док);
				
		КонецЦикла; // выборка по документам
	КонецЦикла; // по объектам печати
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Покупатели(п_Док)
	
	Покупатели = Новый Массив;
	Для каждого Т Из п_Док.Товары Цикл
		ПокупательСтрокой = Строка(Т.АналитикаРасходов);
		Если Покупатели.Найти(ПокупательСтрокой) = Неопределено Тогда
			Покупатели.Добавить(ПокупательСтрокой);
		КонецЕсли;
	КонецЦикла;

	Возврат СтрСоединить(Покупатели, ", ");

КонецФункции // ()

Функция РеквизитыПеревозки(п_Док)
	
	Результат = Новый Структура;
	Результат.Вставить("Водитель");
	Результат.Вставить("Транспорт");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Водитель КАК Водитель,
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ТранспортноеСредство КАК Транспорт
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", п_Док);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.Водитель = Выборка.Водитель;
		Результат.Транспорт = Выборка.Транспорт;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
