// Копирование файла в другую папку с добавлением даты к имени файла.

ПапкаСкрипт	= АргументыКоманднойСтроки[0];
ИмяФайла	= АргументыКоманднойСтроки[1];

ПапкаПриемник	= ТекущийКаталог();
ПутьBin			= ОбъединитьПути(ПапкаСкрипт, "..", "bin");
Источник		= ПутьBin + "\" + ИмяФайла;

Файл_Источник = Новый Файл(Источник);
Если Не Файл_Источник.Существует() Тогда
	Сообщить("Файл не найден: " + Источник);
	ЗавершитьРаботу(1);
КонецЕсли;

Файл_Приемник = Новый Файл(ПапкаПриемник);
Если Не Файл_Приемник.Существует() Тогда
	Сообщить("Папка-приемник не найден: " + ПапкаПриемник);
	ЗавершитьРаботу(1);
КонецЕсли;

// Отделяем расширение от имени файла
ИмяБезРасширения = ИмяФайла;
Расширение = "";

ПозицияТочки = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца);
Если ПозицияТочки > 0 Тогда
	ИмяБезРасширения = Лев(ИмяФайла, ПозицияТочки - 1);
	Расширение = Сред(ИмяФайла, ПозицияТочки + 1);
КонецЕсли;

//ДатаСтрокой = Формат(ТекущаяДата(), "ДФ=ddMMyy");
ДатаСтрокой = Формат(Файл_Источник.ПолучитьВремяИзменения(), "ДФ=ddMMyy");

НовоеИмя = ИмяБезРасширения + " " + ДатаСтрокой;

Если Расширение <> "" Тогда
	НовоеИмя = НовоеИмя + "." + Расширение;
КонецЕсли;

Приемник = ПапкаПриемник + "\" + НовоеИмя;

КопироватьФайл(Источник, Приемник);
Сообщить("Файл скопирован: " + Приемник);