Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма());
	ПараметрыРегистрации.Вставить("Версия", "1.1");
	ПараметрыРегистрации.Вставить("Назначение", ИнициализироватьМассивНазначениий());
	ПараметрыРегистрации.Вставить("Наименование", "УПД для документа Заказ на внутреннее потребление");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", "УПД для документа Заказ на внутреннее потребление (06-22)");
	ПараметрыРегистрации.Вставить("ВерсияБСП", СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	ТаблицаКоманд = ИнициализироватьТаблицуКоманд(Метаданные.Справочники.ДополнительныеОтчетыИОбработки.ТабличныеЧасти.Команды.Реквизиты);
	ДобавитьКоманду(ТаблицаКоманд, НСтр("ru='Универсальный передаточный документ (УПД)'"), "УПД", "ВызовСерверногоМетода", Истина,"ПечатьXML", Ложь, "УПД" );
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	ПараметрыРегистрации.Вставить("Разрешения", Новый Массив);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ИнициализироватьТаблицуКоманд(РеквизитыТабличнойЧасти)
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", РеквизитыТабличнойЧасти.Представление.Тип);
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", РеквизитыТабличнойЧасти.Идентификатор.Тип);
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", РеквизитыТабличнойЧасти.ПоказыватьОповещение.Тип);
	ТаблицаКоманд.Колонки.Добавить("Модификатор", РеквизитыТабличнойЧасти.Модификатор.Тип);
	ТаблицаКоманд.Колонки.Добавить("Скрыть",      РеквизитыТабличнойЧасти.Скрыть.Тип);
	ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", РеквизитыТабличнойЧасти.ЗаменяемыеКоманды.Тип);
	
	Возврат ТаблицаКоманд;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление = "", Идентификатор = "", Использование = "ВызовСерверногоМетода", ПоказыватьОповещение = Ложь, Модификатор = "", Скрыть = Истина, ЗаменяемыеКоманды = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление                = Представление;
	НоваяКоманда.Идентификатор                = Идентификатор;
	НоваяКоманда.Использование                = Использование;
	НоваяКоманда.ПоказыватьОповещение         = ПоказыватьОповещение;
	НоваяКоманда.Модификатор                  = Модификатор;
	НоваяКоманда.Скрыть                       = Скрыть;
	НоваяКоманда.ЗаменяемыеКоманды            = ЗаменяемыеКоманды;
	
КонецПроцедуры

Функция ИнициализироватьМассивНазначениий()
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.ЗаказНаВнутреннееПотребление");
	
	Возврат МассивНазначений;
	
КонецФункции

//////////////////////// 

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УПД") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"УПД",
			НСтр("ru='Универсальный передаточный документ (УПД)'"),
			СформироватьПечатнуюФормуУПД(СтруктураТипов, ОбъектыПечати, МассивОбъектов, ПараметрыПечати));
		
	КонецЕсли;
	
	//ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	//ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры // Печать()  

#Область Печать_УПД

Функция СформироватьПечатнуюФормуУПД(СтруктураТипов, ОбъектыПечати, МассивОбъектов, ПараметрыПечати = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из МассивОбъектов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПараметрыПечати.Вставить("НеВыводитьУПДПосредника", Истина);
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыУПД(ПараметрыПечати, МассивОбъектов);
		
		Если ДанныеДляПечати <> Неопределено Тогда
			ЗаполнитьТабличныйДокументУПД(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
		КонецЕсли;
		
	КонецЦикла;
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьРеквизитыШапкиУПД(ДанныеПечати, ОбластьМакета, ОпцииПечати)
	
	Док = ДанныеПечати.Ссылка;
	Товары = ДанныеПечати.Ссылка.Товары;
	
	ПараметрыШапки = Новый Структура;
	
	ПараметрыШапки.Вставить("СтатусУПД",		1);
	ПараметрыШапки.Вставить("Номер",			ДанныеПечати.Номер);
	ПараметрыШапки.Вставить("Дата",				Формат(Док.ДатаОтгрузки, "ДЛФ=ДД"));
	ПараметрыШапки.Вставить("НомерИсправления",	"--");
	ПараметрыШапки.Вставить("ДатаИсправления",	"--");
	
	// Поставщик
	СвОбОрг = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Док.Организация, Док.Дата);

	ПараметрыШапки.Вставить("ПредставлениеПоставщика",	СвОбОрг.СокращенноеНаименование);
	ПараметрыШапки.Вставить("АдресПоставщика",			СвОбОрг.ЮридическийАдрес);
	ПараметрыШапки.Вставить("ИННПоставщика",			?(ПустаяСтрока(СвОбОрг.КПП), СвОбОрг.ИНН, СвОбОрг.ИНН +"/"+ СвОбОрг.КПП));
	ПараметрыШапки.Вставить("ПредставлениеГрузоотправителя", "он же");

	// Покупатель
	Контрагент = "";
	Если Товары.Количество() > 0 Тогда
		АналитикаРасходов = Товары[0].АналитикаРасходов;
		Если ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.Партнеры") Тогда
			Партнер = АналитикаРасходов;
			Контрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(АналитикаРасходов);
		ИначеЕсли ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.ПрочиеРасходы") Тогда
			ТекПартнер = Справочники.Партнеры.НайтиПоНаименованию(АналитикаРасходов, Истина);
			Контрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(ТекПартнер);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		СвОбОргКонтр = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Контрагент, Док.Дата);
		
		ПараметрыШапки.Вставить("ПредставлениеГрузополучателя", СвОбОргКонтр.СокращенноеНаименование + " " + Док.АдресДоставки);

		УНП = Контрагент.НалоговыйНомер;
		Если ПустаяСтрока(УНП) Тогда
			ИННКонтрагента = "ИНН " + ?(ПустаяСтрока(СвОбОргКонтр.КПП), СвОбОргКонтр.ИНН, СвОбОргКонтр.ИНН +"/"+ СвОбОргКонтр.КПП);
		Иначе
			ИННКонтрагента = "УНП " + УНП;
		КонецЕсли;

		ПараметрыШапки.Вставить("ПредставлениеПокупателя",	СвОбОргКонтр.СокращенноеНаименование);
		ПараметрыШапки.Вставить("АдресПокупателя",			СвОбОргКонтр.ЮридическийАдрес);
		ПараметрыШапки.Вставить("ИННПокупателя",			ИННКонтрагента);
	КонецЕсли;

	ПараметрыШапки.Вставить("ПоДокументу", "-- от --");
	
	ПараметрыШапки.Вставить("Валюта",										НСтр("ru='Российский рубль, 643'", Метаданные.Языки.Русский.КодЯзыка));
	ПараметрыШапки.Вставить("ИдентификаторГосКонтракта", 					"");

	ОбластьМакета.Параметры.Заполнить(ПараметрыШапки);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПодвалаУПД(ОбластьПодвала, ДанныеПечати, Док)
	
	ОбластьПодвала.Параметры.Заполнить(ДанныеПечати);
	
	СтруктураПараметров = Новый Структура;
	
	ОЛ = ОтветственныеЛицаБП.ОтветственныеЛица(Док.Организация, ТекущаяДатаСеанса());
	
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Док.Организация, ДанныеПечати.Дата);
	
	СтруктураПараметров.Вставить("ФИОРуководителя", ОЛ.Руководитель);
	Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураПараметров.Вставить("ФИОРуководителяОрганизации", ОЛ.Руководитель);
		СтруктураПараметров.Вставить("ФИОРуководителя", ОЛ.Руководитель);
		СтруктураПараметров.Вставить("ФИОГлавногоБухгалтера", ОЛ.ГлавныйБухгалтер);
		СтруктураПараметров.Вставить("ДолжностьРуководителя", "Генеральный директор");

		СвОбОрг = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Док.Организация, Док.Дата);
		ПредставлениеОрганизации = СвОбОрг.СокращенноеНаименование + " " + ?(ПустаяСтрока(СвОбОрг.КПП), СвОбОрг.ИНН, СвОбОрг.ИНН +"/"+ СвОбОрг.КПП);
		СтруктураПараметров.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
	Иначе
		СтруктураПараметров.Вставить("ФИОПБОЮЛ", ОЛ.Руководитель);
		СтруктураПараметров.Вставить("ФИОРуководителя", ОЛ.Руководитель);
		Свидетельство = "ОГРНИП: " + Док.Организация.ОГРН + ", дата регистрации: "
			+ Формат(Док.Организация.ДатаРегистрации, "ДЛФ=DD");
		СтруктураПараметров.Вставить("Свидетельство", Свидетельство);
		СтруктураПараметров.Вставить("ДолжностьРуководителя", "ИП");

		СвОбОрг = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Док.Организация, Док.Дата);
		ПредставлениеОрганизации = СвОбОрг.СокращенноеНаименование + " " + Док.Организация.ОГРН;
		СтруктураПараметров.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
	КонецЕсли;

	ТекстОснование = "Заказ № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Док.Номер)
		+ " от " + Формат(Док.ДатаОтгрузки, "ДФ=dd.MMMM.yyyy");
	
	СтруктураПараметров.Вставить("Основание", ТекстОснование);
	СтруктураПараметров.Вставить("ДатаДокумента", Формат(Док.ДатаОтгрузки, "ДФ=dd.MMMM.yyyy"));
	
	Контрагент = "";
	Если Док.Товары.Количество() > 0 Тогда
		АналитикаРасходов = Док.Товары[0].АналитикаРасходов;
		Если ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.Партнеры") Тогда
			Партнер = АналитикаРасходов;
			Контрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(АналитикаРасходов);
		ИначеЕсли ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.ПрочиеРасходы") Тогда
			ТекПартнер = Справочники.Партнеры.НайтиПоНаименованию(АналитикаРасходов, Истина);
			Контрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(ТекПартнер);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		СвОбОргКонтр = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Контрагент, Док.Дата);
		
		УНП = Контрагент.НалоговыйНомер;
		Если ПустаяСтрока(УНП) Тогда
			ИННКонтрагента = " ИНН " + ?(ПустаяСтрока(СвОбОргКонтр.КПП), СвОбОргКонтр.ИНН, СвОбОргКонтр.ИНН +"/"+ СвОбОргКонтр.КПП);
		Иначе
			ИННКонтрагента = " УНП " + УНП;
		КонецЕсли;

		ПредставлениеКонтрагента = СвОбОргКонтр.СокращенноеНаименование + ИННКонтрагента;
		СтруктураПараметров.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
	КонецЕсли;
	
	ОбластьПодвала.Параметры.Заполнить(СтруктураПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьТабличныйДокументУПД(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати) Экспорт
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	МакетУПД_1096 		= ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент1096_ru");
	
	ОпцииПечати = Новый Структура;
	ОпцииПечати.Вставить("НомерСформированВСчетеФактуре", ДанныеДляПечати.Свойство("НомерСформированВСчетеФактуре"));
		
	ДанныеПечати        = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		Док = ДанныеПечати.Ссылка;
		Товары = ДанныеПечати.Ссылка.Товары;
		
		Макет = МакетУПД_1096;
		ЕстьПостановление1096 = Истина;
		Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
		// Выводим общие реквизиты шапки
		ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрокаСтандарт	= Макет.ПолучитьОбласть("Строка");
		ОбластьИтого			= Макет.ПолучитьОбласть("Итого");
		ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");

		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШапка, ДанныеПечати.Ссылка);
		ЗаполнитьРеквизитыШапкиУПД(ДанныеПечати, ОбластьШапка, ОпцииПечати);
		
		НомерСтраницы = 1;
		
		// Инициализация итогов в документе
		ИтоговыеСуммы = СтруктураИтоговыеСуммы();
		
		// Создаем массив для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;
		
		// Выводим многострочную часть документа
		
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Док.Организация, ДанныеПечати.Дата);
		ЗаполнитьРеквизитыПодвалаУПД(ОбластьПодвал, ДанныеПечати, Док);
		Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтавкаНДС = "22%";
		Иначе
			СтавкаНДС = "5%";
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
			
		ВыводитьКодыТНВЭД = Истина;
		
		КоличествоСтрок = 0;
		Для каждого СтрокаТовары Из Товары Цикл
			КоличествоСтрок = КоличествоСтрок + 1;
		КонецЦикла;
		
		ОбластьШапка.Параметры.ПоДокументуОтгрузки = НСтр("ru='-- от --'");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);

		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
		
		НомерСтроки = 0;
		Для каждого СтрокаТовары Из Товары Цикл
			
			ОбластьСтрока = ОбластьСтрокаСтандарт;
			НомерСтроки = НомерСтроки + 1;
			
			ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьСтрока, НомерСтроки, СтавкаНДС);
			ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьСтрока);
			
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
			
			Если НомерСтроки = КоличествоСтрок Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьИтого);
				МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
				ОбластьНумерацияЛистов.Параметры.Номер = ДанныеПечати.Номер;
				ОбластьНумерацияЛистов.Параметры.Дата = Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");
				ОбластьНумерацияЛистов.Параметры.НомерСтраницы = НомерСтраницы;
				
				ТабличныйДокумент.Вывести(ОбластьНумерацияЛистов);
				ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары);

		КонецЦикла;
		
		// Выводим итоги по документу
		ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);
		
		ИтоговыеСуммы.ИтогоСуммаНДС = 0;
		
		ОбластьИтого.Параметры.Заполнить(ИтоговыеСуммы);
		ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьИтого);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		КоличествоСтраниц = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ составлен на %1 %2'", Метаданные.Языки.Русский.КодЯзыка),
			НомерСтраницы,
			ОбщегоНазначенияУТКлиентСервер.ФормаМножественногоЧисла(
				НСтр("ru = 'листе'", Метаданные.Языки.Русский.КодЯзыка), 
				НСтр("ru = 'листах'", Метаданные.Языки.Русский.КодЯзыка), 
				НСтр("ru = 'листах'", Метаданные.Языки.Русский.КодЯзыка), НомерСтраницы));
		СтруктураПараметров = Новый Структура("КоличествоСтраниц", КоличествоСтраниц);
		ОбластьПодвал.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеПечати.Ссылка);
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, ВсегоНомеров, ВалютаРегламентированногоУчета)
	
	ИтоговыеСуммы.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", ЧислоПрописью(ВсегоНомеров, ,",,,,,,,,0"));
	ИтоговыеСуммы.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтоговыеСуммы.ИтогоСуммаСНДС, ВалютаРегламентированногоУчета));
	
КонецПроцедуры

Процедура РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары)
	
	СтруктураСуммПоСтроке = СтруктураРесурсовДляИтогов();
	
	ЗаполнитьЗначенияСвойств(СтруктураСуммПоСтроке, СтрокаТовары);
	ОкруглитьДоЦелого(СтруктураСуммПоСтроке.КоличествоМест);
	Для Каждого Элемент Из СтруктураСуммПоСтроке Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] = ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] + Элемент.Значение;
			ИтоговыеСуммы["Итого"+Элемент.Ключ] = ИтоговыеСуммы["Итого"+Элемент.Ключ] + Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьМакета, НомерСтроки, СтавкаНДС)
	
	ИспользоватьНаборы = Ложь;
	
	ПрефиксИПостфикс = НаборыСервер.ПолучитьПрефиксИПостфикс(СтрокаТовары, ИспользоватьНаборы);
	
	ОбластьМакета.Параметры.Заполнить(СтрокаТовары);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КоличествоМест", 0);
	СтруктураПараметров.Вставить("КоличествоВОдномМесте", 0);
	СтруктураПараметров.Вставить("НоменклатураКод", "");
	СтруктураПараметров.Вставить("КодТНВЭД", "--");
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, СтрокаТовары);
	ОкруглитьДоЦелого(СтруктураПараметров.КоличествоМест);
	СтруктураПараметров.Вставить("НомерСтроки", НомерСтроки);
	
	ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
	ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара = Ложь;
	СтруктураПараметров.КодТНВЭД = "--";
	
	ПредставлениеНоменклатуры =  ПрефиксИПостфикс.Префикс
		+ НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			Строка(СтрокаТовары.Номенклатура.НаименованиеПолное),
			,
			,
			,
			ДополнительныеПараметрыПолученияНаименованияДляПечати)
		+ ПрефиксИПостфикс.Постфикс;
	
	СтруктураПараметров.Вставить("ПредставлениеНоменклатуры",		ПредставлениеНоменклатуры);
	СтруктураПараметров.Вставить("НоменклатураКод",					СтрокаТовары.Номенклатура.Артикул);
	СтруктураПараметров.Вставить("Акциз",							"без акциза");
	СтруктураПараметров.Вставить("СтавкаНДС",						СтавкаНДС);
	СтруктураПараметров.Вставить("ЕдиницаИзмеренияКод",				СтрокаТовары.Номенклатура.ЕдиницаИзмерения.Код);
	СтруктураПараметров.Вставить("ЕдиницаИзмеренияНаименование",	СтрокаТовары.Номенклатура.ЕдиницаИзмерения);
		
	ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
	
КонецПроцедуры

Функция СтруктураИтоговыеСуммы()
	
	Структура = Новый Структура;
	
	СтруктураРесурсовДляИтогов = СтруктураРесурсовДляИтогов();
	
	Для Каждого Элемент Из СтруктураРесурсовДляИтогов Цикл
		Структура.Вставить("Итого"+Элемент.Ключ+"НаСтранице", 0);
		Структура.Вставить("Итого"+Элемент.Ключ, 0);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыУПД(Знач ПараметрыПечати, МассивОбъектов) Экспорт
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка               КАК Ссылка,
	|	ДанныеДокументов.Организация          КАК Организация,
	|	ДанныеДокументов.Подразделение        КАК Подразделение,
    |	&Валюта								  КАК Валюта,
	|	НЕОПРЕДЕЛЕНО			              КАК Контрагент,
	|	ДанныеДокументов.Склад                КАК Склад,
	|	ДанныеДокументов.Дата                 КАК Дата
	|
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление КАК ДанныеДокументов
	|
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
	
	УчетНДСРФ.ДополнитьЗапросПолученияДанныхДляПечатиУПД(Запрос, "Дата,Контрагент");

	Запрос.Выполнить();
	
	ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
	ПараметрыЗаполнения.ВключаяНомераГТД = Истина;
	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Ссылка.Организация КАК Организация,
	|	ЛОЖЬ КАК ЕстьУслуги,
	|	ИСТИНА КАК ЕстьТовары
	|ПОМЕСТИТЬ
	|	НоменклатураДокументов
	|ИЗ
	|	ЗаказНаВнутреннееПотреблениеТаблицаТоваров КАК ТаблицаТоваров
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Ссылка.Организация
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	2 КАК СтатусУПД,
	|	&ПредставлениеСчетФактура КАК ПредставлениеДокумента,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ЛОЖЬ КАК Исправление,
	|	"""" КАК СтрокаПоДокументу,
	|	0 КАК ИндексПодразделения,
	|	ДанныеДокумента.Организация.Префикс КАК Префикс,
	|	ДанныеДокумента.АдресДоставки КАК АдресДоставки,
	|	Ложь КАК ТолькоУслуги,
	|	Ложь КАК ЭтоПередачаНаКомиссию,
	|	Ложь КАК ТребуетсяНаличиеСФ
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаДокумента.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаДокумента.Номенклатура.Код
	|	КОНЕЦ КАК НоменклатураКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаДокумента.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ &ТекстЗапросаКодЕдиницыИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.Упаковка КАК Упаковка
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		ТаблицаТоваров.Ссылка,
	|		ТаблицаТоваров.Номенклатура,
	|		ТаблицаТоваров.Количество,
	|		ТаблицаТоваров.Упаковка
	|	ИЗ
	|		ЗаказНаВнутреннееПотреблениеТаблицаТоваров КАК ТаблицаТоваров
	|) КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"&ТекстЗапросаЕдиницаИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Ссылка",
			"ТаблицаДокумента.Упаковка",
			"ТаблицаДокумента.Номенклатура"));
			
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"&ТекстЗапросаНаименованиеЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Наименование",
			"ТаблицаДокумента.Упаковка",
			"ТаблицаДокумента.Номенклатура"));
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"&ТекстЗапросаКодЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Код",
			"ТаблицаДокумента.Упаковка",
			"ТаблицаДокумента.Номенклатура"));
	
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	Запрос.УстановитьПараметр("ПредставлениеСчетФактура", НСтр("ru='счет-фактура'"));
	Запрос.УстановитьПараметр("КолонкаКодов", КолонкаКодов);
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[1];
	РезультатПоТабличнойЧасти = МассивРезультатов[2];
	СтруктураДанныхДляПечати  = Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	                                             РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения = Неопределено) Экспорт
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",     Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ПересчитыватьВВалютуРегл",       ПараметрыЗаполнения.ПересчитыватьВВалютуРегл);
	Запрос.УстановитьПараметр("ВключаяНомераГТД",               ПараметрыЗаполнения.ВключаяНомераГТД);
	Запрос.УстановитьПараметр("ПустаяГТД",                      Справочники.НомераГТД.ПустаяСсылка());
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Упаковка КАК Упаковка
	|
	|ПОМЕСТИТЬ СтрокиТоваров
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ТаблицаТоваров
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаДанныхДокументов КАК ДанныеДокументов
	|	ПО
	|		ТаблицаТоваров.Ссылка = ДанныеДокументов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Упаковка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Упаковка
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка                                 КАК Ссылка,
	|	ТаблицаДокумента.Номенклатура                           КАК Номенклатура,
	|	СУММА(ТаблицаДокумента.Количество)                      КАК Количество,
	|	0														КАК СуммаБезНДС,
	|	0														КАК СуммаНДС,
	|	ЛОЖЬ                                                    КАК ЭтоТовар,
	|	ЛОЖЬ                                                    КАК ЭтоНеВозвратнаяТара,
	|	ЛОЖЬ                                                    КАК ВернутьМногооборотнуюТару,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)  КАК Упаковка
	|
	|ПОМЕСТИТЬ ЗаказНаВнутреннееПотреблениеТаблицаТоваров
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ТаблицаДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаДанныхДокументов КАК ДанныеДокументов
	|	ПО
	|		ТаблицаДокумента.Ссылка = ДанныеДокументов.Ссылка
	|	
	|ГДЕ
	|	ТаблицаДокумента.Номенклатура.ТипНоменклатуры В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Номенклатура,
	|	ТаблицаДокумента.Упаковка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СтрокиТоваров
	|";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура УстановитьПараметр(ОбластьМакета, ИмяПараметра, ЗначениеПараметра)
	ОбластьМакета.Параметры.Заполнить(Новый Структура(ИмяПараметра, ЗначениеПараметра));
КонецПроцедуры

Функция СтруктураРесурсовДляИтогов()
	
	Структура = Новый Структура;
	
	Структура.Вставить("СуммаБезНДС",       0);
	Структура.Вставить("СуммаНДС",          0);
	Структура.Вставить("СуммаСНДС",         0);
	Структура.Вставить("Количество",        0);
	Структура.Вставить("КоличествоМест",    0);
	Структура.Вставить("КоличествоПринято", 0);
	Структура.Вставить("МассаБрутто",       0);
	Структура.Вставить("МассаНетто",        0);
	Структура.Вставить("Сумма",             0);
	
	Структура.Вставить("РазницаБезНДСУвеличение", 0);
	Структура.Вставить("РазницаБезНДСУменьшение", 0);
	Структура.Вставить("РазницаНДСУвеличение",    0);
	Структура.Вставить("РазницаНДСУменьшение",    0);
	Структура.Вставить("РазницаСНДСУвеличение",   0);
	Структура.Вставить("РазницаСНДСУменьшение",   0);
	
	Возврат Структура;
	
КонецФункции

Процедура ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьМакета)

	Для Сч = 0 По ОбластьМакета.Параметры.Количество() - 1 Цикл
		
		ТекПараметр = ОбластьМакета.Параметры.Получить(Сч);
		
		Если НЕ ЗначениеЗаполнено(ТекПараметр) Тогда
			ОбластьМакета.Параметры.Установить(Сч, "--");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОкруглитьДоЦелого(ОкругляемоеЧисло)
	Если ЗначениеЗаполнено(ОкругляемоеЧисло) Тогда
		Если ОкругляемоеЧисло <> Цел(ОкругляемоеЧисло) Тогда
			ОкругляемоеЧисло = Цел(ОкругляемоеЧисло) + 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти














